package com.sist.main;
/*
 *   관련된 내용을 묶어서 처리 
 *   1. 데이터 여러개
 *       = 같은 크기의 데이터 => 배열
 *       = 다른 크기의 데이터 => 클래스 (사용자 정의 데이터형) 
 *       =========================================== 참조변수 
 *   2. 명령문이 여러개 
 *       ; => 한명령을 cpu에 전달 => 컴퓨터 수행 
 *         => 컴퓨터에 명령을 내려서 실행 (프로그램) 
 *         => 보기 쉽게 묶어준다 (단락) => 가독성 ==> 메소드 
 *       메소드안에는 3개가 들어간다 
 *        (변수+연산자+제어문) => 메소드 => 재사용을 할 수 있다 
 *       => 반드시 한개의 기능만 수행이 가능하게 만든다 
 *       => 예) 게시판 ==> 댓글형 ==> 묻고답하기 ==> 갤러리게시판 
 *             글쓰기 
 *             내용보기 
 *             수정
 *             삭제
 *             검색
 *             목록출력 
 *          예) 회원가입 
 *             아이디중복 
 *             우편번호 검색 
 *             회원가입
 *             취소 
 *          예) 영화예매 
 *              영화목록 
 *              극장목록
 *              예약일 선택
 *              시간 선택 
 *              인원 선택 
 *              예매 
 *              좌석 선택 
 *              =======
 *              예매내역 출력
 */
public class MainClass4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
