package com.sist.main;
// 450~456 Object
/*
 *   ÀÚ¹Ù ¶óÀÌºê·¯¸® 
 *   Å¬·¡½º 
 *   =====
 *     1. »ç¿ëÀÚ Á¤ÀÇ Å¬·¡½º 
 *          = µ¥ÀÌÅÍ ÀúÀå¿ë (º¯¼ö => ÀĞ±â/¾²±â) => Ä¸½¶È­ 
 *          = ±â´É(¿äÃ») Ã³¸® (¸Ş¼Òµå) => »ó¼Ó(Àç»ç¿ë)
 *          = ¼±¾ğ => ÀÎÅÍÆäÀÌ½º 
 *     2. ¶óÀÌºê·¯¸® (ÀÚ¹Ù Á¦°ø , ¿ÜºÎ¿¡¼­ Á¦°ø => Jsoup , lombok)
 *     3. Á¶¸³ Å¬·¡½º (main() => Å¬·¡½º)
 *   ÀÚ¹ÙÀÇ ¶óÀÌºê·¯¸® 
 *   =============
 *      java , javax = (È®ÀåµÈ ¹öÀü:XML,À¥,JSON...) => JDK1.2 
 *      =====
 *       java.lang : ÀÚ¹ÙÀÇ ±âº» ¶óÀÌºê·¯¸® => Å¬·¡½º(Æ¯ÀÌÁ¡=> final)
 *                   => »ó¼ÓÀ» ¹Ş¾Æ¼­ ¿À¹ö¶óÀÌµùÀ» ÇÒ ¼ö ¾ø´Ù 
 *                   => ÀÖ´Â ±×´ë·Î »ç¿ë => Æ÷ÇÔÅ¬·¡½º 
 *                   => °íÁ¤µÈ Å¬·¡½º 
 *       ========== ÇØ´ç Å¬·¡½º ============
 *       1. Object 
 *          => ÀÚ¹ÙÀÇ ÃÖ»óÀ§ Å¬·¡½º (¸ğµç Å¬·¡½º¿¡ »ó¼Ó ³»·ÁÁØ Å¬·¡½º)
 *          => ÄÄÆÄÀÏ·¯°¡ ÀÚµ¿À¸·Î »ó¼ÓÀ» ³»·Á¼­ Ã³¸® (¸ğµç Object·ÎºÎÅÍ ½ÃÀÛ)
 *          => Object Å¬·¡½º´Â ¸ğµç µ¥ÀÌÅÍÇü°ªÀ» ¹ŞÀ» ¼ö ÀÖ´Â Å¬·¡½º 
 *             Object i=10;
 *             Object i=10.5;
 *             Object i='A';
 *             Object i="aaa"; ==> °¡Àå Å« µ¥ÀÌÅÍÇü
 *             ´ÜÁ¡ => Çüº¯È¯ 
 *             ¹è¿­ => °°Àº µ¥ÀÌÅÍÇü 
 *             Object[] obj={"È«±æµ¿",20,'A',10.5}
 *             int[] i={10,20,'A','b'...}
 *             int i='A'
 *                   ==== ÀÚµ¿ Çüº¯È¯ (65)
 *          => ±â´É (¸ğµç Å¬·¡½º) 
 *             1) clone : ¸Ş¸ğ¸® º¹Á¦ÇÑÈÄ¿¡ »õ·Î¿î ¸Ş¸ğ¸®¸¦ ¸¸µé¾î ÁØ´Ù 
 *                        => prototype : °ÔÀÓ ¾Æ¹ÙÅ¸ Á¦ÀÛ 
 *                           ========== ½ºÇÁ¸µ(½Ì±ÛÅÏ=>prototype)
 *             2) toString() : »ı·«ÀÌ °¡´É , °´Ã¼°¡ °¡Áö°í ÀÖ´Â ³»¿ëÀ» ¹®ÀÚ¿­
 *                ===> °¡Àå ¸¹ÀÌ ¿À¹ö¶óÀÌµù
 *                Object obj=new Object();
 *                System.out.println(obj);
 *                System.out.println(obj.toString()); 
 *             3) finalize() : ¼Ò¸êÀÚÇÔ¼ö (°´Ã¼ ¸Ş¸ğ¸® ÇØÁ¦) ÀÚµ¿ È£ÃâµÇ´Â ¸Ş¼Òµå
 *                ========== °¡ºñÁö ÄÃ·º¼Ç 
 *       2. String 
 *            => Å¬·¡½º / ÀÏ¹İ µ¥ÀÌÅÍÇü => ¹®ÀÚ¿­¸¸ ÀúÀåÇÏ´Â Å¬·¡½º
 *               ÀÏ¹İ µ¥ÀÌÅÍÇü 
 *                 String s=""; (*******)
 *               Å¬·¡½º 
 *                 String s=new String("");
 *               *** "" => ¹®ÀÚ¿­(¹®ÀÚ¸¦ ¿©·¯°³ ÀúÀåÀÌ °¡´É)
 *                      => ¹®ÀÚ¿­ ÀÚÃ¼°¡ ÁÖ¼Ò´Ù 
 *               *** String a="Hello";
 *               if("Hello".equals(a))  ""=>StringÀÌ °¡Áö°í ÀÖ´Â ¸ğµç ¸Ş™“,¤Ñ»ç¿ë 
 *            => char[]¸¦ ÀÌ¿ëÇØ¼­ ¸¸µç ÇÁ·Î±×·¥ 
 *            => ±â´É(¸Ş¼Òµå) 
 *               1. length() : ¹®ÀÚ °¹¼ö
 *               2. substring() : ¿øÇÏ´Â ºÎºĞÀÇ µ¥ÀÌÅÍ ÀÚ¸£±â 
 *               3. indexOf() / lastIndexOf() : ÇØ´ç ¹®ÀÚ.¹®ÀÚ¿­
 *                  =========   =============
 *                   ¾Õ¿¡¼­         µÚ¿¡¼­ 
 *               4. replace() / replaceAll() => ¹®ÀÚÀÇ ÇüÅÂ¸¦ ¸¸µé¾î 
 *                                              ÇØ´ç³»¿ë º¯°æ 
 *                                              => Á¤±Ô½Ä
 *                                              [°¡-ÆR],[A-Z]
 *                                              [a-z],[0-9]
 *                                              .*Hello*.
 *                                              ^[°¡-ÆR]
 *                                              [A-Z]$ =====> AI
 *                  =========
 *                    Æ¯Á¤ ¹®ÀÚ.¹®ÀÚ¿­ º¯°æ 
 *               5. equals() : ¸Ş¸ğ¸®¾È¿¡ ÀúÀåµÈ ¹®ÀÚ¿­ÀÌ °°ÀºÁö ¿©ºÎ 
 *                             ·Î±×ÀÎ , ¾ÆÀÌµğÃ£±â , ¾ÆÀÌµğÁßº¹ 
 *               6. trim() : ÁÂ¿ìÀÇ °ø¹éÁ¦°Å 
 *                           <a> Hello</a>
 *                           »ç¿ëÀÚÀÇ ½Ç¼ö => space
 *               7. valueOf() : ÀÏ¹İµ¥ÀÌÅÍÇü(±âº»)À» ¹®ÀÚ¿­ÇüÀ¸·Î º¯°æ 
 *                              valueOf(10) => "10"
 *               8. split() : ±¸ºĞ¹®ÀÚ·Î ºĞÇØ => ¹è¿­ 
 *                  ======= Á¤±Ô½Ä (¹®ÀÚÆĞÅÏ) 
 *               9. contains() => Æ÷ÇÔ ¿©ºÎ (ÃßÃµ)
 *               10. ÀÚµ¿¿Ï¼º±â : startsWith(),endsWith()
 *       3. StringBuffer(ÀÓ½ÃÀúÀåÀå¼Ò ¸¸µçÈÄ => µ¥ÀÌÅÍ¸¦ ´Ù ¸ğ¾ÆÁØ´Ù)
 *            => append() => ¹®ÀÚ¿­ °áÇÕ 
 *            => toString() : ÀúÀåµÈ ¸ğµç µ¥ÀÌÅÍ Ãâ·Â 
 *            => ¹®ÀÚ¿­°áÇÕÀÇ ÃÖÀûÈ­ => ´ë¿ë·® ¹®ÀÚ¿­ 
 *       4. Math => ¼öÇĞ°ü·Ã ±â´É 
 *            => random() => 0.0~0.99 »çÀÌÀÇ ÀÓÀÇÀÇ ¼ö¸¦ ÃßÃâ
 *            => ceil() => ÆäÀÌÂ¡ ±â¹ı (ÃÑÆäÀÌÁö) => ¿Ã¸² 
 *               => 10.1  ==> 11 , 10.0 ==> 10
 *            => round() => ¹İ¿Ã¸² 
 *            => ¿À¶óÅ¬¾È¿¡µµ µ¿ÀÏÇÑ ÇÔ¼ö°¡ Á¸Àç 
 *       5. Wrapper
 *            => 
 *            ±âº»Çü      Å¬·¡½º   ==> ±âº»Çü µ¥ÀÌÅÍ¸¦ ½±°Ô Á¦¾î
 *                 <=== ¾ğ¹Ú½Ì
 *            int       Integer
 *            double    Double
 *            float     Float
 *            boolean   Boolean 
 *            long      Long
 *                  ===> ¹Ú½Ì(¿ÀÅä¹Ú½Ì)
 *                  
 *            Integer i=10; ¹Ú½Ì
 *            int i=new Integer(1); ¾ğ¹Ú½Ì ==> int , Integer
 *                                  ==> Á¦³×¸¯½º 
 *                                      <int>(X) <Integer>(Å¬·¡½ºÇü)
 *            ==> ¹®ÀÚ¿­ => ÇØ´ç µ¥ÀÌÅÍÇüÀ¸·Î º¯°æ 
 *                Integer.parseInt("10") => 10
 *                Double.parseDouble("10.5") => 10.5
 *                Boolean.parseBoolean("true") => true
 *       6. System
 *            ==> System.out => Ç¥ÁØ Ãâ·Â => print, println,printf
 *                System.in  => Ç¥ÁØ ÀÔ·Â => read
 *                System.exit(0) => ÇÁ·Î±×·¥ Á¤»ó Á¤·á
 *                System.gc() => ¸Ş¸ğ¸® ÇØÁ¦ ¿äÃ» (°¡ºñÁö ÄÃ·º¼Ç)
 *       java.util
 *            ==> Date , Calendar , StringTokenizer
 *                Date:½Ã½ºÅÛÀÇ ³¯Â¥.½Ã°£ Á¤º¸ 
 *                Calendar : ¿ù (0~11) ==> month-1
 *                           ¿äÀÏ (1~7) ==> week-1
 *                StringTokenizer
 *                 = countTokens() : ÀÚ¸¥ °¹¼ö
 *                 = hasMoreTokens() : ÀÚ¸¥ µ¥ÀÌÅÍ À¯¹« 
 *                 = nextToken() : ÀÚ¸¥ µ¥ÀÌÅÍ¸¦ ÀĞ¾î ¿Â´Ù 
 *            ==> Collection
 *       java.text
 *       java.io
 *       java.net
 *       
 *   ¿ÜºÎ¿¡¼­ Á¦°øÇÏ´Â ¶óÀÌºê·¯¸®(¿ÀÇÂ ¼Ò½º) => mvnrepository  
 *   =====================
 */
class B
{
	
}
class A
{

	@Override
	public String toString() {
		// TODO Auto-generated method stub
		return "Hello A!!";
	}
	
}
public class ¹®Á¦_Object {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
        A a=new A();
        System.out.println(a);
        B b=new B();
        System.out.println(b);// °´Ã¼ ÁÖ¼Ò°ª Ãâ·Â 
	}

}
