package com.sist.vo;
/*
 *   클래스 종류 
 *   ========
 *   1. 데이터 저장 (사용자 정의 데이터형) => 변수 (읽기/쓰기) => 캡슐화 
 *   2. 기능 (메소드를 가지고 제어) => 저장된 데이터 활용 
 *                               ============== 라이브러리 활용 
 *   ========================= 관련된 클래스가 많이 존재한다 (인터페이스)
 *   객체지향 프로그램 : 관련된 내용을 어떻게 모아서 관리 (재사용) 
 *   
 *   CGV(영화) ==> 메가박스 (상속) => 재정의 
 *            ==> 롯데시네마 (상속) => 재정의 
 *            
 *   실제 영화를 출력한다면 => 영화정보를 한번에 모아서 처리
 *                                ============== 컬렉션 (ArrayList)
 *                                
 *   지니뮤직(뮤직) ==> Mnet (상속) ==> 재정의 (다형성)
 *                        =====
 *                        지니뮤직을 재사용 
 *                   멜론 (상속)  ==> 재정의 (다형성)
 *                       =====
 *                        지니뮤직을 재사용  
 *   *** 관련된 내용을 잘 묶어서 사용 (핵심) 
 */
public class MainClass2 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
